tap "azure/functions"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "rsteube/homebrew-tap"

brew "angular-cli"
brew "asdf"
brew "azcopy"
brew "azure-cli"
brew "azure/functions/azure-functions-core-tools@3"
brew "bash"
brew "bash-language-server"
brew "bat"
brew "bazel"
brew "black"
brew "buildifier"
brew "carapace"
brew "curl"
brew "docker-credential-helper"
brew "dust"
brew "elvish"
brew "exa"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "glow"
brew "gnu-tar"
brew "go"
brew "gopls"
brew "imagemagick"
brew "jq"
brew "lua-language-server"
brew "mas"
brew "moar"
brew "mypy"
brew "neovim"
brew "node"
brew "nushell"
brew "openjdk"
brew "pgformatter"
brew "postgresql"
brew "potrace"
brew "prettier"
brew "pulumi"
brew "pylint"
brew "pyright"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "stow"
brew "stylua"
brew "tokei"
brew "vivid"
brew "wget"
brew "yaml-language-server"

cask "appcleaner"
cask "docker"
cask "dotnet-sdk"
cask "font-jetbrains-mono"
cask "font-sf-pro"
cask "font-sora"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "parsec"
cask "paw"
cask "proxyman"
cask "raycast"
cask "tower"
cask "visual-studio-code"
cask "wezterm"
cask "zoom"

mas "Affinity Designer", id: 824171161
mas "Bear", id: 1091189122
mas "Hush Nag Blocker", id: 1544743900
mas "Keys Multiplatform", id: 1494642810
mas "Reeder", id: 1529448980
mas "Wipr", id: 1320666476
