tap "azure/functions"
tap "clementtsang/bottom"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

brew "python@3.9"
brew "azure-cli"
brew "bash"
brew "bat"
brew "black"
brew "cmake"
brew "curl"
brew "deno"
brew "exa"
brew "fd"
brew "fish"
brew "fzf"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnu-tar"
brew "go"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "lf"
brew "mas"
brew "neovim", args: ["HEAD"]
brew "node"
brew "pgformatter"
brew "postgresql"
brew "pre-commit"
brew "prettier"
brew "pulumi"
brew "qt@5", link: true
brew "potrace"
brew "ripgrep"
brew "ruby"
brew "rustup-init"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "stow"
brew "tmux"
brew "tokei"
brew "vim"
brew "wget"
brew "yarn"
brew "zoxide"
brew "azure/functions/azure-functions-core-tools@3"
brew "clementtsang/bottom/bottom"

cask "1password"
cask "adoptopenjdk8"
cask "alacritty"
cask "alfred"
cask "appcleaner"
cask "docker"
cask "dotnet-sdk"
cask "font-jetbrains-mono"
cask "gitup"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "mailmate"
cask "microsoft-edge"
cask "ngrok"
cask "rectangle"
cask "visual-studio-code"
cask "wireshark"
cask "zoom"

mas "Affinity Designer", id: 824171161
mas "Bear", id: 1091189122
mas "Reeder", id: 1529448980
