tap "azure/bicep"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "rsteube/homebrew-tap"

brew "act"
brew "angular-cli"
brew "azure-cli"
brew "bash"
brew "bat"
brew "bicep"
brew "black"
brew "carapace"
brew "curl"
brew "d2"
brew "delve"
brew "docker-credential-helper"
brew "dust"
brew "elvish"
brew "eza"
brew "fd"
brew "fzf"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "glow"
brew "gnu-tar"
brew "go"
brew "gopls"
brew "hexyl"
brew "less"
brew "libpq"
brew "marp-cli"
brew "mas"
brew "node"
brew "prettier"
brew "pyright"
brew "python3"
brew "ripgrep"
brew "rsync"
brew "shellcheck"
brew "shfmt"
brew "sqlite"
brew "sqlparse"
brew "staticcheck"
brew "stow"
brew "streamlink"
brew "tokei"
brew "vim"
brew "wget"

cask "appcleaner"
cask "dash"
cask "docker"
cask "dotnet-sdk"
cask "font-cascadia-code"
cask "font-sf-compact"
cask "font-sf-mono"
cask "font-sf-pro"
cask "gitup"
cask "google-chrome"
cask "kitty"
cask "lookaway"
cask "parsec"
cask "powershell"
cask "proxyman"
cask "rapidapi"
cask "raycast"
cask "rider"
cask "transmission"
cask "visual-studio-code"

mas "1Blocker", id: 1365531024
mas "Bear", id: 1091189122
mas "Cyberduck", id: 409222199
mas "DaisyDisk", id: 411643860
mas "Elmedia:universal video player", id: 937759555
mas "Keys Multiplatform", id: 1494642810
mas "Reeder", id: 1529448980
mas "rcmd", id: 1596283165
