tap "azure/bicep"
tap "hashicorp/tap"
tap "homebrew/bundle"

brew "act"
brew "angular-cli"
brew "azure-cli"
brew "bash"
brew "bat"
brew "bicep"
brew "carapace"
brew "curl"
brew "d2"
brew "delve"
brew "difftastic"
brew "docker-credential-helper"
brew "dust"
brew "elvish"
brew "fd"
brew "git"
brew "git-lfs"
brew "gitu"
brew "glow"
brew "gnu-tar"
brew "go"
brew "gopls"
brew "harper"
brew "helix"
brew "hexyl"
brew "jq"
brew "less"
brew "libpq"
brew "lua-language-server"
brew "marp-cli"
brew "mas"
brew "neovim"
brew "npm-check-updates"
brew "node"
brew "pandoc"
brew "prettier"
brew "pyright"
brew "python3"
brew "ripgrep"
brew "rsync"
brew "ruff"
brew "rustup"
brew "shellcheck"
brew "shfmt"
brew "sqlite"
brew "sqlparse"
brew "staticcheck"
brew "stow"
brew "streamlink"
brew "stylua"
brew "terraform"
brew "terraform-ls"
brew "tinymist"
brew "tokei"
brew "tree"
brew "typescript-language-server"
brew "typst"
brew "typstyle"
brew "vim"
brew "vscode-langservers-extracted"
brew "wget"
brew "zig"
brew "zls"

cask "dash"
cask "docker"
cask "dotnet-sdk"
cask "font-cascadia-code"
cask "font-sf-mono"
cask "font-sf-pro"
cask "ghostty"
cask "gitup"
cask "google-chrome"
cask "homerow"
cask "kitty"
cask "powershell"
cask "pronotes"
cask "proxyman"
cask "raycast"
cask "rider"
cask "transmission"
cask "visual-studio-code"
cask "zed"

mas "1Blocker", id: 1365531024
mas "DaisyDisk", id: 411643860
mas "Raycast Companion", id: 6738274497
mas "TestFlight", id: 899247664
mas "rcmd", id: 1596283165
