tap "dagger/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "rsteube/homebrew-tap"

brew "angular-cli"
brew "azure-cli"
brew "bash"
brew "bash-language-server"
brew "bat"
brew "bazel"
brew "black"
brew "buildifier"
brew "carapace"
brew "curl"
brew "dagger"
brew "dagger-cue"
brew "docker-credential-helper"
brew "dust"
brew "elvish", args: ["HEAD"]
brew "exa"
brew "fd"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "glow"
brew "gnu-tar"
brew "go"
brew "gopls"
brew "helix"
brew "hexyl"
brew "jq"
brew "lua-language-server"
brew "mas"
brew "moar"
brew "mypy"
brew "neovim"
brew "node"
brew "nushell"
brew "openjdk"
brew "pgformatter"
brew "postgresql@15"
brew "prettier"
brew "pulumi"
brew "pylint"
brew "pyright"
brew "python3"
brew "ripgrep"
brew "rsync"
brew "shellcheck"
brew "shfmt"
brew "stow"
brew "streamlink"
brew "stylua"
brew "tokei"
brew "vivid"
brew "wget"
brew "yaml-language-server"

cask "appcleaner"
cask "dash"
cask "datagrip"
cask "docker"
cask "dotnet-sdk"
cask "font-jetbrains-mono"
cask "font-rubik"
cask "font-sf-pro"
cask "goland"
cask "google-chrome"
cask "parsec"
cask "paw"
cask "proxyman"
cask "pycharm"
cask "raycast"
cask "rider"
cask "visual-studio-code"
cask "webstorm"
cask "wezterm"
cask "zoom"

mas "Affinity Designer", id: 824171161
mas "Bear", id: 1091189122
mas "Cyberduck", id: 409222199
mas "Elmedia:universal video player", id: 937759555  
mas "Gitfox", id: 1475511261
mas "Hush", id: 1544743900
mas "Keys Multiplatform", id: 1494642810
mas "Reeder", id: 1529448980
mas "Wipr", id: 1320666476
mas "rcmd • App Switcher", id: 1596283165
