tap "azure/functions"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

brew "angular-cli"
brew "asdf"
brew "azcopy"
brew "azure-cli"
brew "azure/functions/azure-functions-core-tools@3"
brew "bash"
brew "bat"
brew "bazel"
brew "black"
brew "buildifier"
brew "cabal-install"
brew "curl"
brew "elvish"
brew "exa"
brew "fd"
brew "fish"
brew "fisher"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "glow"
brew "gnu-tar"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "mas"
brew "neovim"
brew "node"
brew "pgformatter"
brew "postgresql"
brew "potrace"
brew "pre-commit"
brew "prettier"
brew "pulumi"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "stow"
brew "stylua"
brew "tokei"
brew "vim"
brew "wget"
brew "yarn"
brew "zoxide"

cask "appcleaner"
cask "docker"
cask "dotnet-sdk"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "google-chrome"
cask "iterm2"
cask "jetbrains-toolbox"
cask "paw"
cask "raycast"
cask "tower"
cask "visual-studio-code"
cask "zoom"

mas "Affinity Designer", id: 824171161
mas "Hush Nag Blocker", id: 1544743900
mas "Keyword Search", id: 1558453954
mas "Reeder", id: 1529448980
mas "Vimlike", id: 1584519802
mas "Wipr", id: 1320666476
