angular.ng-template
asvetliakov.vscode-neovim
charliermarsh.ruff
christian-kohler.path-intellisense
davidanson.vscode-markdownlint
editorconfig.editorconfig
elijah-potter.harper
elves.elvish
esbenp.prettier-vscode
github.copilot
github.copilot-chat
golang.go
hashicorp.terraform
ionide.ionide-fsharp
mechatroner.rainbow-csv
ms-azuretools.vscode-containers
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-ossdata.vscode-pgsql
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode.powershell
ms-vscode.remote-explorer
ms-vscode.remote-server
myriad-dreamin.tinymist
redhat.vscode-yaml
rust-lang.rust-analyzer
terrastruct.d2
ziglang.vscode-zig
