alefragnani.Bookmarks
Angular.ng-template
BazelBuild.vscode-bazel
bradymholt.pgformatter
christian-kohler.path-intellisense
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
esbenp.prettier-vscode
eseom.nunjucks-template
GitHub.copilot
golang.go
GraphQL.vscode-graphql
Ionide.Ionide-fsharp
jebbs.plantuml
justusadam.language-haskell
mechatroner.rainbow-csv
ms-azuretools.vscode-bicep
ms-azuretools.vscode-docker
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-vscode-remote.remote-containers
ms-vscode.cpptools
redhat.vscode-yaml
streetsidesoftware.code-spell-checker
usernamehw.errorlens
VisualStudioExptTeam.vscodeintellicode
vscodevim.vim
