angular.ng-template
charliermarsh.ruff
csharpier.csharpier-vscode
davidanson.vscode-markdownlint
editorconfig.editorconfig
elijah-potter.harper
esbenp.prettier-vscode
github.copilot-chat
golang.go
gregoire.dance
gregoire.dance-helix
hashicorp.terraform
ms-azuretools.vscode-containers
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-mssql.data-workspace-vscode
ms-mssql.mssql
ms-mssql.sql-bindings-vscode
ms-mssql.sql-database-projects-vscode
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode.remote-explorer
ms-vscode.remote-server
myriad-dreamin.tinymist
redhat.vscode-yaml
terrastruct.d2
tombi-toml.tombi
vitest.explorer
