tap "azure/functions"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "fzf"
brew "pulumi"
brew "azure/functions/azure-functions-core-tools@3"
cask "adoptopenjdk8"
cask "alacritty"
cask "alfred"
cask "amethyst"
cask "appcleaner"
cask "docker"
cask "dungeon-crawl-stone-soup-tiles"
cask "font-input"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "microsoft-excel"
cask "microsoft-teams"
cask "ngrok"
cask "openemu"
cask "visual-studio-code"
cask "wireshark"
cask "zoomus"
