tap "azure/functions"
tap "cjbassi/gotop"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "jesseduffield/lazygit"
brew "python@3.8"
brew "azure-cli"
brew "bat"
brew "cabal-install"
brew "exa"
brew "fd"
brew "fish"
brew "fzf"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "go"
brew "jq"
brew "lf"
brew "node"
brew "pgcli"
brew "postgresql@10"
brew "pulumi"
brew "pyenv"
brew "ripgrep"
brew "ruby"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "stow"
brew "tmux"
brew "vim"
brew "yarn"
brew "azure/functions/azure-functions-core-tools@3"
brew "cjbassi/gotop/gotop"
brew "jesseduffield/lazygit/lazygit"
cask "adoptopenjdk8"
cask "alacritty"
cask "alfred"
cask "amethyst"
cask "appcleaner"
cask "docker"
cask "dotnet-sdk"
cask "font-input"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "ngrok"
cask "visual-studio-code"
cask "wireshark"
